/*
Navicat MySQL Data Transfer

Source Server         : localhost
Source Server Version : 50714
Source Host           : localhost:3306
Source Database       : redrock_exam

Target Server Type    : MYSQL
Target Server Version : 50714
File Encoding         : 65001

Date: 2017-06-03 17:07:35
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for announcements
-- ----------------------------
DROP TABLE IF EXISTS `announcements`;
CREATE TABLE `announcements` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `title` varchar(255) NOT NULL,
  `content` varchar(255) NOT NULL,
  `publisher_id` int(10) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of announcements
-- ----------------------------
INSERT INTO `announcements` VALUES ('1', '标题', '内容', '2');
INSERT INTO `announcements` VALUES ('2', '标题', '内容\r\n', '2');
INSERT INTO `announcements` VALUES ('3', '标题', '内容\r\n内容', '2');
INSERT INTO `announcements` VALUES ('4', 'test', 'test', '2');

-- ----------------------------
-- Table structure for auth
-- ----------------------------
DROP TABLE IF EXISTS `auth`;
CREATE TABLE `auth` (
  `id` int(1) NOT NULL,
  `auth_name` varchar(20) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of auth
-- ----------------------------
INSERT INTO `auth` VALUES ('1', '学生');
INSERT INTO `auth` VALUES ('2', '老师');
INSERT INTO `auth` VALUES ('3', '管理员');
INSERT INTO `auth` VALUES ('0', '已注销');

-- ----------------------------
-- Table structure for logs
-- ----------------------------
DROP TABLE IF EXISTS `logs`;
CREATE TABLE `logs` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `op` varchar(255) NOT NULL,
  `table` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of logs
-- ----------------------------

-- ----------------------------
-- Table structure for student
-- ----------------------------
DROP TABLE IF EXISTS `student`;
CREATE TABLE `student` (
  `xh` varchar(30) NOT NULL,
  `xm` varchar(30) NOT NULL,
  `xb` varchar(3) NOT NULL,
  `bj` varchar(8) NOT NULL,
  `zyh` varchar(4) NOT NULL,
  `zym` varchar(50) NOT NULL,
  `yxh` varchar(2) NOT NULL,
  `yxm` varchar(50) NOT NULL,
  `nj` varchar(4) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of student
-- ----------------------------
INSERT INTO `student` VALUES ('2015210001', '朱鸿翔', '男', '01901501', '0190', '通信工程专业卓越工程师班', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210002', '刘奇', '男', '01901501', '0190', '通信工程专业卓越工程师班', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210004', '黄思翔', '男', '01011504', '0101', '通信工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210005', '韩赵亮', '男', 'IT011501', '0191', '通信学院IT精英班', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210006', '胡定昊', '男', '01021501', '0102', '电子信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210007', '李纯', '男', '01021501', '0102', '电子信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210008', '杜剑峰', '男', '01021505', '0102', '电子信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210009', '李潇', '男', '01901501', '0190', '通信工程专业卓越工程师班', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210010', '刘宇超', '男', 'IT011501', '0191', '通信学院IT精英班', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210011', '王志鹏', '男', '01901501', '0190', '通信工程专业卓越工程师班', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210012', '熊一谦', '男', '01011505', '0101', '通信工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210013', '彭宇', '男', 'GJ011501', '0192', '通信工程国际实验班', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210014', '周楚航', '男', '01011505', '0101', '通信工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210015', '刘清宇', '男', '01901501', '0190', '通信工程专业卓越工程师班', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210016', '曹汉', '男', '01901501', '0190', '通信工程专业卓越工程师班', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210017', '吉星熹', '男', '01021502', '0102', '电子信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210018', '程曦', '男', '01021502', '0102', '电子信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210019', '吴文陶', '男', '01021504', '0102', '电子信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210020', '胡强', '男', '01011505', '0101', '通信工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210021', '吴天伟', '男', '01021503', '0102', '电子信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210022', '高亮', '男', '01021501', '0102', '电子信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210023', '程锡培', '男', '01021502', '0102', '电子信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210024', '杨鹏', '男', '01021504', '0102', '电子信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210025', '犹鑫', '男', '01021501', '0102', '电子信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210026', '范嘉辉', '男', '01021501', '0102', '电子信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210027', '张哲嘉', '男', '01021505', '0102', '电子信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210028', '王铮', '男', '01041501', '0104', '信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210029', '程禄丰', '男', '01011505', '0101', '通信工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210030', '杨航', '男', '01141601', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2015210031', '吴欣欣', '女', '01041503', '0104', '信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210032', '陈彦如', '女', 'IT011501', '0191', '通信学院IT精英班', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210033', '马玉丹', '女', '01011503', '0101', '通信工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210034', '蒋尧莉', '女', 'IT011501', '0191', '通信学院IT精英班', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210035', '任可心', '女', '01021503', '0102', '电子信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210036', '陈夏霖', '女', '01901501', '0190', '通信工程专业卓越工程师班', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210037', '刘昕玥', '女', 'GJ011501', '0192', '通信工程国际实验班', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210038', '钟雨君', '女', '01011504', '0101', '通信工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210039', '李丽', '女', '01011503', '0101', '通信工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210040', '彭灿', '女', '01021501', '0102', '电子信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210041', '范中源', '女', '01011504', '0101', '通信工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210042', '吴思莹', '女', '01011503', '0101', '通信工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210043', '郑修文', '男', '01011505', '0101', '通信工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210044', '肖泽平', '男', '01021502', '0102', '电子信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210045', '刘浩杰', '男', '01011504', '0101', '通信工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210046', '袁新儒', '男', '01041501', '0104', '信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210047', '李瑞', '男', 'IT011501', '0191', '通信学院IT精英班', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210048', '刘成鑫', '男', 'IT011501', '0191', '通信学院IT精英班', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210049', '吴越', '男', '01011504', '0101', '通信工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210050', '陈明', '男', '01011505', '0101', '通信工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210051', '柯昌浩', '男', '01021501', '0102', '电子信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210052', '尚浩然', '男', 'IT011501', '0191', '通信学院IT精英班', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210053', '李云杰', '男', '01011504', '0101', '通信工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210054', '袁瑞', '男', '01041501', '0104', '信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210055', '刘言', '男', '01021505', '0102', '电子信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210056', '单飞宇', '男', '01021505', '0102', '电子信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210057', '何缘', '男', '01901501', '0190', '通信工程专业卓越工程师班', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210058', '杨润明', '男', '01901501', '0190', '通信工程专业卓越工程师班', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210059', '卢思宏', '男', '01011505', '0101', '通信工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210061', '贺杨洪', '男', '01041502', '0104', '信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210062', '傅安民', '男', '01011504', '0101', '通信工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210064', '李松', '男', '01011503', '0101', '通信工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210065', '尚炳呈', '男', '01021505', '0102', '电子信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210066', '王志', '男', '01021503', '0102', '电子信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210067', '宋浩南', '男', '01011505', '0101', '通信工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210068', '向晋钱', '男', '01021505', '0102', '电子信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210069', '刘东坡', '男', '01041501', '0104', '信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210070', '刘广敏', '男', '01021503', '0102', '电子信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210071', '邓乂铭', '男', '01011504', '0101', '通信工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210072', '邹政', '男', '01041501', '0104', '信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210073', '张雨萱', '女', 'IT011501', '0191', '通信学院IT精英班', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210074', '崔文娟', '女', 'IT011501', '0191', '通信学院IT精英班', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210075', '刘璇', '女', '01901501', '0190', '通信工程专业卓越工程师班', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210076', '任媛', '女', '01901501', '0190', '通信工程专业卓越工程师班', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210077', '李羿莹', '女', '01041502', '0104', '信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210078', '潘多', '女', '01901501', '0190', '通信工程专业卓越工程师班', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210079', '何梅', '女', '01011504', '0101', '通信工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210080', '刘露花', '女', '01041503', '0104', '信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210081', '解诗娟', '女', '01041501', '0104', '信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210082', '舒凡一', '女', 'GJ011501', '0192', '通信工程国际实验班', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210083', '谭阳', '女', '01041501', '0104', '信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210084', '严沁春', '女', '01041503', '0104', '信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210085', '汪智平', '男', '01901501', '0190', '通信工程专业卓越工程师班', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210086', '陈东航', '男', '01011505', '0101', '通信工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210087', '张威', '男', 'GJ011501', '0192', '通信工程国际实验班', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210088', '易剑锋', '男', '01041502', '0104', '信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210089', '张天皓', '男', 'IT011501', '0191', '通信学院IT精英班', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210090', '刘湃', '男', 'IT011501', '0191', '通信学院IT精英班', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210091', '苏海超', '男', '01041501', '0104', '信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210092', '万志远', '男', '01901501', '0190', '通信工程专业卓越工程师班', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210093', '张家伟', '男', '01901501', '0190', '通信工程专业卓越工程师班', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210094', '任帆', '男', '01041502', '0104', '信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210095', '彭俊', '男', '01901501', '0190', '通信工程专业卓越工程师班', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210096', '周极', '男', '01011504', '0101', '通信工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210097', '杨杰', '男', '01021503', '0102', '电子信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210098', '朱良伟', '男', '01011505', '0101', '通信工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210099', '易祖政', '男', '01041502', '0104', '信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210100', '刘金鑫', '男', '01901501', '0190', '通信工程专业卓越工程师班', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210101', '杨贵钦', '男', '01021504', '0102', '电子信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210102', '余扬', '男', '01041503', '0104', '信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210103', '刘颖', '男', '01011503', '0101', '通信工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210104', '安鑫', '男', '01021503', '0102', '电子信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210105', '周渝阳', '男', '01021501', '0102', '电子信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210106', '何理', '男', '01041502', '0104', '信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210107', '袁圣东', '男', '01021503', '0102', '电子信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210108', '张松', '男', '01021505', '0102', '电子信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210109', '吴航', '男', '01021504', '0102', '电子信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210110', '荣安珉', '男', '01041501', '0104', '信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210112', '付思成', '男', '01901501', '0190', '通信工程专业卓越工程师班', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210113', '何植', '男', '01021502', '0102', '电子信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210114', '谭望', '男', '01041503', '0104', '信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2015210115', '赵泽桐', '女', '01011505', '0101', '通信工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2016210001', '王小妮', '女', '01141601', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210002', '何江月', '女', '01141601', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210001', '王小妮', '女', '01141601', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210003', '杜扬', '女', '01901601', '0190', '通信工程专业卓越工程师班', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210002', '何江月', '女', '01141601', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210004', '李雨', '女', '01911601', '0191', '通信学院IT精英班', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210003', '杜扬', '女', '01901601', '0190', '通信工程专业卓越工程师班', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210005', '汤光玲', '女', '01141601', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210004', '李雨', '女', '01911601', '0191', '通信学院IT精英班', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210006', '谭应鑫', '女', '01141601', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210005', '汤光玲', '女', '01141601', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210007', '李婷', '女', '01141601', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210006', '谭应鑫', '女', '01141601', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210007', '李婷', '女', '01141601', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210008', '曹希孟', '女', '01141601', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210009', '谭雨薇', '女', '01141601', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210012', '吴啸凡', '男', '01141601', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210013', '陈俊帆', '男', '01141601', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210014', '贺易', '男', '01141601', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210016', '肖涛', '男', '01911601', '0191', '通信学院IT精英班', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210017', '潘玮峰', '男', '01141601', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210018', '李学定', '男', '01141601', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210019', '陈伟龙', '男', '01911601', '0191', '通信学院IT精英班', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210020', '朱思韬', '男', '01141601', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210021', '梁建明', '男', '01141601', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210022', '周雅风', '男', '01141601', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210023', '龚渝恒', '男', '01141601', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210024', '张越', '男', '01901601', '0190', '通信工程专业卓越工程师班', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210025', '黄成林', '男', '01901601', '0190', '通信工程专业卓越工程师班', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210026', '黄俊涛', '男', '01141601', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210027', '费阳', '男', '01141601', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210028', '邵俊鑫', '男', '01141601', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210029', '胡元洋', '男', '01141601', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210030', '郎凤林', '男', '01141601', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210031', '王鹏', '男', '01141601', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210032', '杨天铭', '男', '01141601', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210033', '李德鑫', '男', '01141601', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210034', '姚原', '男', '01141601', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210035', '王云涛', '男', '01141601', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210036', '季东生', '女', '01141602', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210037', '韩铭', '女', '01141602', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210038', '徐闯', '女', '01141602', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210039', '刘佳', '女', '01911601', '0191', '通信学院IT精英班', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210040', '刘玲玲', '女', '01141602', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210042', '贺春瑛', '女', '01141602', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210043', '毕萍', '女', '01141602', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210044', '李霜', '女', '01141602', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210045', '严以宁', '男', '01901601', '0190', '通信工程专业卓越工程师班', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210046', '梁盛源', '男', '01901601', '0190', '通信工程专业卓越工程师班', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210047', '穆城', '男', '01901601', '0190', '通信工程专业卓越工程师班', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210048', '刘梦君', '男', '01141602', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210049', '杨瑞鑫', '男', '01141602', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210050', '薛东林', '男', '01901601', '0190', '通信工程专业卓越工程师班', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210051', '兰铭成', '男', '01911601', '0191', '通信学院IT精英班', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210052', '梅子剑', '男', '01901601', '0190', '通信工程专业卓越工程师班', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210053', '江昊东', '男', '01141602', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210054', '梁蒸胤', '男', '01911601', '0191', '通信学院IT精英班', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210055', '吴松泽', '男', '01141602', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210056', '江松芸', '男', '01141602', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210057', '王家军', '男', '01141602', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210058', '袁瑞', '男', '01141602', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210059', '彭子豪', '男', '01141602', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210060', '蒋汶航', '男', '01141602', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210061', '石浩宇', '男', '01141602', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210062', '龙渝', '男', '01141602', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210063', '胡志强', '男', '01141602', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210064', '田松江', '男', '01141602', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210065', '张鑫', '男', '01911601', '0191', '通信学院IT精英班', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210066', '阳皓晴', '男', '01141602', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210067', '郑雄峰', '男', '01141602', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210068', '李明佳', '男', '01141602', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210069', '孟玉林', '男', '01141602', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210070', '冯星星', '男', '01141602', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210071', '张敏', '女', '01141603', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210072', '朱若楠', '女', '01911601', '0191', '通信学院IT精英班', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210073', '李悦', '女', '01141603', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210074', '章淑惠', '女', '01141603', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210075', '邓蓉', '女', '01141603', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210076', '朱锦文', '女', '01141603', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210077', '黎园园', '女', '01141603', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210078', '夏慧诗', '女', '01141603', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210079', '叶香麟', '女', '01141603', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210080', '刘亚辉', '男', '01901601', '0190', '通信工程专业卓越工程师班', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210081', '甘胜海', '男', '01141603', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210082', '孙合序', '男', '01141603', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210083', '岳勇良', '男', '01141603', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210084', '万梦军', '男', '01141603', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210085', '董西宇', '男', '01141603', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210086', '缪祥', '男', '01911601', '0191', '通信学院IT精英班', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210087', '范大千', '男', '01141603', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210088', '周杰', '男', '01141603', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210089', '祝逸飞', '男', '01141603', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210090', '梁炬鸿', '男', '01141603', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210091', '李定举', '男', '01141603', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210092', '柯达', '男', '01141603', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210093', '徐茁', '男', '01141603', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210094', '游小彬', '男', '01141603', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210095', '何凡', '男', '01141603', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210096', '夏茂洲', '男', '01141603', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210097', '石李城', '男', '01901601', '0190', '通信工程专业卓越工程师班', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210098', '罗浩文', '男', '01141603', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210099', '张鑫', '男', '01141603', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210100', '陈钦', '男', '01141603', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210101', '梁庆', '男', '01141603', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210102', '郭浩男', '男', '01141603', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210103', '谭林', '男', '01141603', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210104', '付勇奇', '男', '01141603', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210105', '刘洪权', '男', '01141603', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210106', '贯圆意', '女', '01141604', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210107', '闫孟哲', '女', '01911601', '0191', '通信学院IT精英班', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210108', '王颢潼', '女', '01901601', '0190', '通信工程专业卓越工程师班', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210109', '刘艺锦', '女', '01141604', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210110', '陶思琪', '女', '01141604', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210111', '龙思樵', '女', '01141604', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210112', '蒋明月', '女', '01141604', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210113', '王琳', '女', '01141604', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210114', '陈晨', '女', '01141604', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210115', '马盼元', '男', '01141604', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210116', '刘吉', '男', '01141604', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210117', '李尧', '男', '01911601', '0191', '通信学院IT精英班', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210118', '李泽宇', '男', '01901601', '0190', '通信工程专业卓越工程师班', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210119', '欧阳思铭', '男', '01141604', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210120', '李炅炜', '男', '01141604', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210121', '林志强', '男', '01911601', '0191', '通信学院IT精英班', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2016210122', '宋林校', '男', '01141604', '0114', '通信与信息类', '01', '通信与信息工程学院', '2016');
INSERT INTO `student` VALUES ('2014210001', '郑韵雯', '女', 'GJ011401', '0192', '通信工程国际实验班', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210002', '佘佳玲', '女', '01041401', '0104', '信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210003', '尤洋洋', '女', '01051401', '0105', '广播电视工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210004', '孟倩英', '女', '01051401', '0105', '广播电视工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210005', '宋艾遥', '女', '01011401', '0101', '通信工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210006', '郭业蛟', '女', 'GJ011401', '0192', '通信工程国际实验班', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210007', '莫雪莎', '女', '0191403', '0191', '通信学院IT精英班', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210008', '王婧', '女', '01011401', '0101', '通信工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210009', '李鑫', '女', '01041402', '0104', '信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210010', '冉俊玲', '女', '01021401', '0102', '电子信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210011', '钟艾玲', '女', '01011401', '0101', '通信工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210012', '徐浩', '男', '01021401', '0102', '电子信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210013', '沙桐', '男', '01021401', '0102', '电子信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210014', '冯秋明', '男', '0191401', '0190', '通信工程专业卓越工程师班', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210015', '陶子鸣', '男', '01021401', '0102', '电子信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210016', '冯航涛', '男', '0191403', '0191', '通信学院IT精英班', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210017', '夏小刚', '男', '01041401', '0104', '信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210018', '欧阳转', '男', '01021401', '0102', '电子信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210019', '宋子亮', '男', '01021401', '0102', '电子信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210020', '丁鸽', '男', '0191402', '0190', '通信工程专业卓越工程师班', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210021', '王尚尚', '男', '01021401', '0102', '电子信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210022', '陈镤镭', '男', '0191403', '0191', '通信学院IT精英班', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210024', '陈证元', '男', '01021401', '0102', '电子信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210025', '张浩', '男', '01021401', '0102', '电子信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210026', '贺燕华', '男', '01021401', '0102', '电子信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210028', '李鑫', '男', '01041401', '0104', '信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210029', '彭泓月', '男', '01021401', '0102', '电子信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210030', '景坤飞', '男', '0191401', '0190', '通信工程专业卓越工程师班', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210031', '张何堰', '男', '01011401', '0101', '通信工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210033', '段书桥', '男', '01021401', '0102', '电子信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210034', '刘慧', '女', '01011401', '0101', '通信工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210035', '周玉佳', '女', '01021401', '0102', '电子信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210036', '成书杉', '女', '0191402', '0190', '通信工程专业卓越工程师班', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210037', '杨梦梅', '女', '01041401', '0104', '信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210038', '陈露', '女', '01021401', '0102', '电子信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210039', '李蔚星', '女', '01051401', '0105', '广播电视工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210040', '杜静菲', '女', '0191403', '0191', '通信学院IT精英班', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210041', '曾勤', '女', '01011401', '0101', '通信工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210042', '谢攀', '女', '01021401', '0102', '电子信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210043', '龙鑫', '女', '01011401', '0101', '通信工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210044', '夏吉玲', '女', '01011401', '0101', '通信工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210045', '赵祥祥', '男', '01041402', '0104', '信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210046', '侯宗壮', '男', '01041401', '0104', '信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210047', '苏炳瑄', '男', '01041401', '0104', '信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210048', '韦昌权', '男', '01021401', '0102', '电子信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210049', '宋振远', '男', '01011401', '0101', '通信工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210050', '胡凌', '男', '01041401', '0104', '信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210051', '王江维', '男', '0191403', '0191', '通信学院IT精英班', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210052', '陈瑞', '男', '01011401', '0101', '通信工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210053', '刘鑫', '男', '01021401', '0102', '电子信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210054', '李文龙', '男', '01021401', '0102', '电子信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210055', '吴坤', '男', '0191403', '0191', '通信学院IT精英班', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210056', '李思贤', '男', '01011401', '0101', '通信工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210057', '李筑聪', '男', '01041401', '0104', '信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210058', '刘颖杰', '男', '01021501', '0102', '电子信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2014210059', '李劲宇', '男', '01011401', '0101', '通信工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210060', '王磊', '男', '01011401', '0101', '通信工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210061', '刘迅', '男', '01011401', '0101', '通信工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210062', '江川', '男', '01011401', '0101', '通信工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210063', '周武林', '男', '01051401', '0105', '广播电视工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210064', '刘圣平', '男', '01021401', '0102', '电子信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210065', '刘松林', '男', '01051401', '0105', '广播电视工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210066', '刘磊', '男', '01021401', '0102', '电子信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210067', '胡迎春', '女', '01021401', '0102', '电子信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210068', '龙欣', '女', '01011401', '0101', '通信工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210069', '曹玲', '女', '01021401', '0102', '电子信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210070', '刘燕清', '女', '01021401', '0102', '电子信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210071', '毛骄', '女', '01011401', '0101', '通信工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210072', '卓玛', '女', '01021401', '0102', '电子信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210073', '张若羽', '女', '0191401', '0190', '通信工程专业卓越工程师班', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210074', '李露露', '女', '01011402', '0101', '通信工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210075', '李小可', '女', '01011402', '0101', '通信工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210076', '杜春玲', '女', '01021401', '0102', '电子信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210077', '陈欢', '女', '01021401', '0102', '电子信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210078', '张斌', '男', '01041401', '0104', '信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210079', '何瑞', '男', '01021401', '0102', '电子信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210080', '彭绍志', '男', '01051401', '0105', '广播电视工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210081', '吴育辉', '男', '01041401', '0104', '信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210082', '史雪飞', '男', '01011402', '0101', '通信工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210083', '魏晨', '男', '01021501', '0102', '电子信息工程', '01', '通信与信息工程学院', '2015');
INSERT INTO `student` VALUES ('2014210084', '陈亚彪', '男', '0191403', '0191', '通信学院IT精英班', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210085', '王星宇', '男', 'GJ011401', '0192', '通信工程国际实验班', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210086', '吕仲韬', '男', '01021402', '0102', '电子信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210087', '石明坤', '男', '01051401', '0105', '广播电视工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210089', '王鲲鹏', '男', '01011402', '0101', '通信工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210090', '曾阳', '男', '01011402', '0101', '通信工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210091', '杨恒', '男', '0191403', '0191', '通信学院IT精英班', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210092', '寿炳', '男', '01011402', '0101', '通信工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210093', '周林川', '男', '01041401', '0104', '信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210094', '夏黄卫', '男', '01041401', '0104', '信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210095', '刘洋', '男', '01021402', '0102', '电子信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210096', '邹文杰', '男', '01011402', '0101', '通信工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210097', '冉迎希', '男', '01021402', '0102', '电子信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210098', '唐德智', '男', '01021402', '0102', '电子信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210099', '方强', '男', '01021402', '0102', '电子信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210100', '简晓雯', '女', '01011402', '0101', '通信工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210101', '邓夏茹', '女', '0191402', '0190', '通信工程专业卓越工程师班', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210102', '陈金玉', '女', '01011402', '0101', '通信工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210103', '张楠楠', '女', '01051401', '0105', '广播电视工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210104', '曾玉', '女', '0191401', '0190', '通信工程专业卓越工程师班', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210105', '央吉', '女', '01021402', '0102', '电子信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210106', '陈容', '女', '01041402', '0104', '信息工程', '01', '通信与信息工程学院', '2014');
INSERT INTO `student` VALUES ('2014210107', '唐万梅', '女', '01021402', '0102', '电子信息工程', '01', '通信与信息工程学院', '2014');

-- ----------------------------
-- Table structure for students
-- ----------------------------
DROP TABLE IF EXISTS `students`;
CREATE TABLE `students` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `password` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `gender` varchar(3) CHARACTER SET utf8 NOT NULL,
  `class_num` varchar(8) CHARACTER SET utf8 NOT NULL,
  `major_num` varchar(4) CHARACTER SET utf8 NOT NULL,
  `major` varchar(50) CHARACTER SET utf8 NOT NULL,
  `grade` varchar(4) CHARACTER SET utf8 NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `remember_token` varchar(100) COLLATE utf8_unicode_ci DEFAULT NULL,
  `auth` int(1) NOT NULL DEFAULT '1',
  PRIMARY KEY (`id`),
  KEY `username` (`name`)
) ENGINE=MyISAM AUTO_INCREMENT=340 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

-- ----------------------------
-- Records of students
-- ----------------------------
INSERT INTO `students` VALUES ('1', '朱鸿翔', '2015210001', '男', '01901501', '0190', '通信工程专业卓越工程师班', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('2', '刘奇', '2015210002', '男', '01901501', '0190', '通信工程专业卓越工程师班', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('3', '黄思翔', '2015210004', '男', '01011504', '0101', '通信工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('4', '韩赵亮', '2015210005', '男', 'IT011501', '0191', '通信学院IT精英班', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('5', '胡定昊', '2015210006', '男', '01021501', '0102', '电子信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('6', '李纯', '2015210007', '男', '01021501', '0102', '电子信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('7', '杜剑峰', '2015210008', '男', '01021505', '0102', '电子信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('8', '李潇', '2015210009', '男', '01901501', '0190', '通信工程专业卓越工程师班', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('9', '刘宇超', '2015210010', '男', 'IT011501', '0191', '通信学院IT精英班', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('10', '王志鹏', '2015210011', '男', '01901501', '0190', '通信工程专业卓越工程师班', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('11', '熊一谦', '2015210012', '男', '01011505', '0101', '通信工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('12', '彭宇', '2015210013', '男', 'GJ011501', '0192', '通信工程国际实验班', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('13', '周楚航', '2015210014', '男', '01011505', '0101', '通信工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('14', '刘清宇', '2015210015', '男', '01901501', '0190', '通信工程专业卓越工程师班', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('15', '曹汉', '2015210016', '男', '01901501', '0190', '通信工程专业卓越工程师班', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('16', '吉星熹', '2015210017', '男', '01021502', '0102', '电子信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('17', '程曦', '2015210018', '男', '01021502', '0102', '电子信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('18', '吴文陶', '2015210019', '男', '01021504', '0102', '电子信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('19', '胡强', '2015210020', '男', '01011505', '0101', '通信工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('20', '吴天伟', '2015210021', '男', '01021503', '0102', '电子信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('21', '高亮', '2015210022', '男', '01021501', '0102', '电子信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('22', '程锡培', '2015210023', '男', '01021502', '0102', '电子信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('23', '杨鹏', '2015210024', '男', '01021504', '0102', '电子信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('24', '犹鑫', '2015210025', '男', '01021501', '0102', '电子信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('25', '范嘉辉', '2015210026', '男', '01021501', '0102', '电子信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('26', '张哲嘉', '2015210027', '男', '01021505', '0102', '电子信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('27', '王铮', '2015210028', '男', '01041501', '0104', '信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('28', '程禄丰', '2015210029', '男', '01011505', '0101', '通信工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('29', '杨航', '2015210030', '男', '01141601', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('30', '吴欣欣', '2015210031', '女', '01041503', '0104', '信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('31', '陈彦如', '2015210032', '女', 'IT011501', '0191', '通信学院IT精英班', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('32', '马玉丹', '2015210033', '女', '01011503', '0101', '通信工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('33', '蒋尧莉', '2015210034', '女', 'IT011501', '0191', '通信学院IT精英班', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('34', '任可心', '2015210035', '女', '01021503', '0102', '电子信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('35', '陈夏霖', '2015210036', '女', '01901501', '0190', '通信工程专业卓越工程师班', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('36', '刘昕玥', '2015210037', '女', 'GJ011501', '0192', '通信工程国际实验班', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('37', '钟雨君', '2015210038', '女', '01011504', '0101', '通信工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('38', '李丽', '2015210039', '女', '01011503', '0101', '通信工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('39', '彭灿', '2015210040', '女', '01021501', '0102', '电子信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('40', '范中源', '2015210041', '女', '01011504', '0101', '通信工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('41', '吴思莹', '2015210042', '女', '01011503', '0101', '通信工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('42', '郑修文', '2015210043', '男', '01011505', '0101', '通信工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('43', '肖泽平', '2015210044', '男', '01021502', '0102', '电子信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('44', '刘浩杰', '2015210045', '男', '01011504', '0101', '通信工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('45', '袁新儒', '2015210046', '男', '01041501', '0104', '信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('46', '李瑞', '2015210047', '男', 'IT011501', '0191', '通信学院IT精英班', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('47', '刘成鑫', '2015210048', '男', 'IT011501', '0191', '通信学院IT精英班', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('48', '吴越', '2015210049', '男', '01011504', '0101', '通信工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('49', '陈明', '2015210050', '男', '01011505', '0101', '通信工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('50', '柯昌浩', '2015210051', '男', '01021501', '0102', '电子信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('51', '尚浩然', '2015210052', '男', 'IT011501', '0191', '通信学院IT精英班', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('52', '李云杰', '2015210053', '男', '01011504', '0101', '通信工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('53', '袁瑞', '2015210054', '男', '01041501', '0104', '信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('54', '刘言', '2015210055', '男', '01021505', '0102', '电子信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('55', '单飞宇', '2015210056', '男', '01021505', '0102', '电子信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('56', '何缘', '2015210057', '男', '01901501', '0190', '通信工程专业卓越工程师班', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('57', '杨润明', '2015210058', '男', '01901501', '0190', '通信工程专业卓越工程师班', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('58', '卢思宏', '2015210059', '男', '01011505', '0101', '通信工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('59', '贺杨洪', '2015210061', '男', '01041502', '0104', '信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('60', '傅安民', '2015210062', '男', '01011504', '0101', '通信工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('61', '李松', '2015210064', '男', '01011503', '0101', '通信工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('62', '尚炳呈', '2015210065', '男', '01021505', '0102', '电子信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('63', '王志', '2015210066', '男', '01021503', '0102', '电子信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('64', '宋浩南', '2015210067', '男', '01011505', '0101', '通信工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('65', '向晋钱', '2015210068', '男', '01021505', '0102', '电子信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('66', '刘东坡', '2015210069', '男', '01041501', '0104', '信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('67', '刘广敏', '2015210070', '男', '01021503', '0102', '电子信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('68', '邓乂铭', '2015210071', '男', '01011504', '0101', '通信工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('69', '邹政', '2015210072', '男', '01041501', '0104', '信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('70', '张雨萱', '2015210073', '女', 'IT011501', '0191', '通信学院IT精英班', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('71', '崔文娟', '2015210074', '女', 'IT011501', '0191', '通信学院IT精英班', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('72', '刘璇', '2015210075', '女', '01901501', '0190', '通信工程专业卓越工程师班', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('73', '任媛', '2015210076', '女', '01901501', '0190', '通信工程专业卓越工程师班', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('74', '李羿莹', '2015210077', '女', '01041502', '0104', '信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('75', '潘多', '2015210078', '女', '01901501', '0190', '通信工程专业卓越工程师班', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('76', '何梅', '2015210079', '女', '01011504', '0101', '通信工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('77', '刘露花', '2015210080', '女', '01041503', '0104', '信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('78', '解诗娟', '2015210081', '女', '01041501', '0104', '信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('79', '舒凡一', '2015210082', '女', 'GJ011501', '0192', '通信工程国际实验班', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('80', '谭阳', '2015210083', '女', '01041501', '0104', '信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('81', '严沁春', '2015210084', '女', '01041503', '0104', '信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('82', '汪智平', '2015210085', '男', '01901501', '0190', '通信工程专业卓越工程师班', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('83', '陈东航', '2015210086', '男', '01011505', '0101', '通信工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('84', '张威', '2015210087', '男', 'GJ011501', '0192', '通信工程国际实验班', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('85', '易剑锋', '2015210088', '男', '01041502', '0104', '信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('86', '张天皓', '2015210089', '男', 'IT011501', '0191', '通信学院IT精英班', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('87', '刘湃', '2015210090', '男', 'IT011501', '0191', '通信学院IT精英班', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('88', '苏海超', '2015210091', '男', '01041501', '0104', '信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('89', '万志远', '2015210092', '男', '01901501', '0190', '通信工程专业卓越工程师班', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('90', '张家伟', '2015210093', '男', '01901501', '0190', '通信工程专业卓越工程师班', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('91', '任帆', '2015210094', '男', '01041502', '0104', '信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('92', '彭俊', '2015210095', '男', '01901501', '0190', '通信工程专业卓越工程师班', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('93', '周极', '2015210096', '男', '01011504', '0101', '通信工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('94', '杨杰', '2015210097', '男', '01021503', '0102', '电子信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('95', '朱良伟', '2015210098', '男', '01011505', '0101', '通信工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('96', '易祖政', '2015210099', '男', '01041502', '0104', '信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('97', '刘金鑫', '2015210100', '男', '01901501', '0190', '通信工程专业卓越工程师班', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('98', '杨贵钦', '2015210101', '男', '01021504', '0102', '电子信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('99', '余扬', '2015210102', '男', '01041503', '0104', '信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('100', '刘颖', '2015210103', '男', '01011503', '0101', '通信工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('101', '安鑫', '2015210104', '男', '01021503', '0102', '电子信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('102', '周渝阳', '2015210105', '男', '01021501', '0102', '电子信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('103', '何理', '2015210106', '男', '01041502', '0104', '信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('104', '袁圣东', '2015210107', '男', '01021503', '0102', '电子信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('105', '张松', '2015210108', '男', '01021505', '0102', '电子信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('106', '吴航', '2015210109', '男', '01021504', '0102', '电子信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('107', '荣安珉', '2015210110', '男', '01041501', '0104', '信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('108', '付思成', '2015210112', '男', '01901501', '0190', '通信工程专业卓越工程师班', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('109', '何植', '2015210113', '男', '01021502', '0102', '电子信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('110', '谭望', '2015210114', '男', '01041503', '0104', '信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('111', '赵泽桐', '2015210115', '女', '01011505', '0101', '通信工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('112', '王小妮', '2016210001', '女', '01141601', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('113', '何江月', '2016210002', '女', '01141601', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('114', '王小妮', '2016210001', '女', '01141601', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('115', '杜扬', '2016210003', '女', '01901601', '0190', '通信工程专业卓越工程师班', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('116', '何江月', '2016210002', '女', '01141601', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('117', '李雨', '2016210004', '女', '01911601', '0191', '通信学院IT精英班', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('118', '杜扬', '2016210003', '女', '01901601', '0190', '通信工程专业卓越工程师班', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('119', '汤光玲', '2016210005', '女', '01141601', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('120', '李雨', '2016210004', '女', '01911601', '0191', '通信学院IT精英班', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('121', '谭应鑫', '2016210006', '女', '01141601', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('122', '汤光玲', '2016210005', '女', '01141601', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('123', '李婷', '2016210007', '女', '01141601', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('124', '谭应鑫', '2016210006', '女', '01141601', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('125', '李婷', '2016210007', '女', '01141601', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('126', '曹希孟', '2016210008', '女', '01141601', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('127', '谭雨薇', '2016210009', '女', '01141601', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('128', '吴啸凡', '2016210012', '男', '01141601', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('129', '陈俊帆', '2016210013', '男', '01141601', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('130', '贺易', '2016210014', '男', '01141601', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('131', '肖涛', '2016210016', '男', '01911601', '0191', '通信学院IT精英班', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('132', '潘玮峰', '2016210017', '男', '01141601', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('133', '李学定', '2016210018', '男', '01141601', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('134', '陈伟龙', '2016210019', '男', '01911601', '0191', '通信学院IT精英班', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('135', '朱思韬', '2016210020', '男', '01141601', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('136', '梁建明', '2016210021', '男', '01141601', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('137', '周雅风', '2016210022', '男', '01141601', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('138', '龚渝恒', '2016210023', '男', '01141601', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('139', '张越', '2016210024', '男', '01901601', '0190', '通信工程专业卓越工程师班', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('140', '黄成林', '2016210025', '男', '01901601', '0190', '通信工程专业卓越工程师班', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('141', '黄俊涛', '2016210026', '男', '01141601', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('142', '费阳', '2016210027', '男', '01141601', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('143', '邵俊鑫', '2016210028', '男', '01141601', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('144', '胡元洋', '2016210029', '男', '01141601', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('145', '郎凤林', '2016210030', '男', '01141601', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('146', '王鹏', '2016210031', '男', '01141601', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('147', '杨天铭', '2016210032', '男', '01141601', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('148', '李德鑫', '2016210033', '男', '01141601', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('149', '姚原', '2016210034', '男', '01141601', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('150', '王云涛', '2016210035', '男', '01141601', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('151', '季东生', '2016210036', '女', '01141602', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('152', '韩铭', '2016210037', '女', '01141602', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('153', '徐闯', '2016210038', '女', '01141602', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('154', '刘佳', '2016210039', '女', '01911601', '0191', '通信学院IT精英班', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('155', '刘玲玲', '2016210040', '女', '01141602', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('156', '贺春瑛', '2016210042', '女', '01141602', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('157', '毕萍', '2016210043', '女', '01141602', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('158', '李霜', '2016210044', '女', '01141602', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('159', '严以宁', '2016210045', '男', '01901601', '0190', '通信工程专业卓越工程师班', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('160', '梁盛源', '2016210046', '男', '01901601', '0190', '通信工程专业卓越工程师班', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('161', '穆城', '2016210047', '男', '01901601', '0190', '通信工程专业卓越工程师班', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('162', '刘梦君', '2016210048', '男', '01141602', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('163', '杨瑞鑫', '2016210049', '男', '01141602', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('164', '薛东林', '2016210050', '男', '01901601', '0190', '通信工程专业卓越工程师班', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('165', '兰铭成', '2016210051', '男', '01911601', '0191', '通信学院IT精英班', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('166', '梅子剑', '2016210052', '男', '01901601', '0190', '通信工程专业卓越工程师班', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('167', '江昊东', '2016210053', '男', '01141602', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('168', '梁蒸胤', '2016210054', '男', '01911601', '0191', '通信学院IT精英班', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('169', '吴松泽', '2016210055', '男', '01141602', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('170', '江松芸', '2016210056', '男', '01141602', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('171', '王家军', '2016210057', '男', '01141602', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('172', '袁瑞', '2016210058', '男', '01141602', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('173', '彭子豪', '2016210059', '男', '01141602', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('174', '蒋汶航', '2016210060', '男', '01141602', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('175', '石浩宇', '2016210061', '男', '01141602', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('176', '龙渝', '2016210062', '男', '01141602', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('177', '胡志强', '2016210063', '男', '01141602', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('178', '田松江', '2016210064', '男', '01141602', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('179', '张鑫', '2016210065', '男', '01911601', '0191', '通信学院IT精英班', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('180', '阳皓晴', '2016210066', '男', '01141602', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('181', '郑雄峰', '2016210067', '男', '01141602', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('182', '李明佳', '2016210068', '男', '01141602', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('183', '孟玉林', '2016210069', '男', '01141602', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('184', '冯星星', '2016210070', '男', '01141602', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('185', '张敏', '2016210071', '女', '01141603', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('186', '朱若楠', '2016210072', '女', '01911601', '0191', '通信学院IT精英班', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('187', '李悦', '2016210073', '女', '01141603', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('188', '章淑惠', '2016210074', '女', '01141603', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('189', '邓蓉', '2016210075', '女', '01141603', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('190', '朱锦文', '2016210076', '女', '01141603', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('191', '黎园园', '2016210077', '女', '01141603', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('192', '夏慧诗', '2016210078', '女', '01141603', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('193', '叶香麟', '2016210079', '女', '01141603', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('194', '刘亚辉', '2016210080', '男', '01901601', '0190', '通信工程专业卓越工程师班', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('195', '甘胜海', '2016210081', '男', '01141603', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('196', '孙合序', '2016210082', '男', '01141603', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('197', '岳勇良', '2016210083', '男', '01141603', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('198', '万梦军', '2016210084', '男', '01141603', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('199', '董西宇', '2016210085', '男', '01141603', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('200', '缪祥', '2016210086', '男', '01911601', '0191', '通信学院IT精英班', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('201', '范大千', '2016210087', '男', '01141603', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('202', '周杰', '2016210088', '男', '01141603', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('203', '祝逸飞', '2016210089', '男', '01141603', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('204', '梁炬鸿', '2016210090', '男', '01141603', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('205', '李定举', '2016210091', '男', '01141603', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('206', '柯达', '2016210092', '男', '01141603', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('207', '徐茁', '2016210093', '男', '01141603', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('208', '游小彬', '2016210094', '男', '01141603', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('209', '何凡', '2016210095', '男', '01141603', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('210', '夏茂洲', '2016210096', '男', '01141603', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('211', '石李城', '2016210097', '男', '01901601', '0190', '通信工程专业卓越工程师班', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('212', '罗浩文', '2016210098', '男', '01141603', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('213', '张鑫', '2016210099', '男', '01141603', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('214', '陈钦', '2016210100', '男', '01141603', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('215', '梁庆', '2016210101', '男', '01141603', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('216', '郭浩男', '2016210102', '男', '01141603', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('217', '谭林', '2016210103', '男', '01141603', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('218', '付勇奇', '2016210104', '男', '01141603', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('219', '刘洪权', '2016210105', '男', '01141603', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('220', '贯圆意', '2016210106', '女', '01141604', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('221', '闫孟哲', '2016210107', '女', '01911601', '0191', '通信学院IT精英班', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('222', '王颢潼', '2016210108', '女', '01901601', '0190', '通信工程专业卓越工程师班', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('223', '刘艺锦', '2016210109', '女', '01141604', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('224', '陶思琪', '2016210110', '女', '01141604', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('225', '龙思樵', '2016210111', '女', '01141604', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('226', '蒋明月', '2016210112', '女', '01141604', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('227', '王琳', '2016210113', '女', '01141604', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('228', '陈晨', '2016210114', '女', '01141604', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('229', '马盼元', '2016210115', '男', '01141604', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('230', '刘吉', '2016210116', '男', '01141604', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('231', '李尧', '2016210117', '男', '01911601', '0191', '通信学院IT精英班', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('232', '李泽宇', '2016210118', '男', '01901601', '0190', '通信工程专业卓越工程师班', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('233', '欧阳思铭', '2016210119', '男', '01141604', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('234', '李炅炜', '2016210120', '男', '01141604', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('235', '林志强', '2016210121', '男', '01911601', '0191', '通信学院IT精英班', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('236', '宋林校', '2016210122', '男', '01141604', '0114', '通信与信息类', '2016', null, null, null, '1');
INSERT INTO `students` VALUES ('237', '郑韵雯', '2014210001', '女', 'GJ011401', '0192', '通信工程国际实验班', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('238', '佘佳玲', '2014210002', '女', '01041401', '0104', '信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('239', '尤洋洋', '2014210003', '女', '01051401', '0105', '广播电视工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('240', '孟倩英', '2014210004', '女', '01051401', '0105', '广播电视工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('241', '宋艾遥', '2014210005', '女', '01011401', '0101', '通信工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('242', '郭业蛟', '2014210006', '女', 'GJ011401', '0192', '通信工程国际实验班', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('243', '莫雪莎', '2014210007', '女', '0191403', '0191', '通信学院IT精英班', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('244', '王婧', '2014210008', '女', '01011401', '0101', '通信工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('245', '李鑫', '2014210009', '女', '01041402', '0104', '信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('246', '冉俊玲', '2014210010', '女', '01021401', '0102', '电子信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('247', '钟艾玲', '2014210011', '女', '01011401', '0101', '通信工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('248', '徐浩', '2014210012', '男', '01021401', '0102', '电子信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('249', '沙桐', '2014210013', '男', '01021401', '0102', '电子信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('250', '冯秋明', '2014210014', '男', '0191401', '0190', '通信工程专业卓越工程师班', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('251', '陶子鸣', '2014210015', '男', '01021401', '0102', '电子信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('252', '冯航涛', '2014210016', '男', '0191403', '0191', '通信学院IT精英班', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('253', '夏小刚', '2014210017', '男', '01041401', '0104', '信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('254', '欧阳转', '2014210018', '男', '01021401', '0102', '电子信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('255', '宋子亮', '2014210019', '男', '01021401', '0102', '电子信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('256', '丁鸽', '2014210020', '男', '0191402', '0190', '通信工程专业卓越工程师班', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('257', '王尚尚', '2014210021', '男', '01021401', '0102', '电子信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('258', '陈镤镭', '2014210022', '男', '0191403', '0191', '通信学院IT精英班', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('259', '陈证元', '2014210024', '男', '01021401', '0102', '电子信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('260', '张浩', '2014210025', '男', '01021401', '0102', '电子信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('261', '贺燕华', '2014210026', '男', '01021401', '0102', '电子信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('262', '李鑫', '2014210028', '男', '01041401', '0104', '信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('263', '彭泓月', '2014210029', '男', '01021401', '0102', '电子信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('264', '景坤飞', '2014210030', '男', '0191401', '0190', '通信工程专业卓越工程师班', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('265', '张何堰', '2014210031', '男', '01011401', '0101', '通信工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('266', '段书桥', '2014210033', '男', '01021401', '0102', '电子信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('267', '刘慧', '2014210034', '女', '01011401', '0101', '通信工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('268', '周玉佳', '2014210035', '女', '01021401', '0102', '电子信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('269', '成书杉', '2014210036', '女', '0191402', '0190', '通信工程专业卓越工程师班', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('270', '杨梦梅', '2014210037', '女', '01041401', '0104', '信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('271', '陈露', '2014210038', '女', '01021401', '0102', '电子信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('272', '李蔚星', '2014210039', '女', '01051401', '0105', '广播电视工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('273', '杜静菲', '2014210040', '女', '0191403', '0191', '通信学院IT精英班', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('274', '曾勤', '2014210041', '女', '01011401', '0101', '通信工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('275', '谢攀', '2014210042', '女', '01021401', '0102', '电子信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('276', '龙鑫', '2014210043', '女', '01011401', '0101', '通信工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('277', '夏吉玲', '2014210044', '女', '01011401', '0101', '通信工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('278', '赵祥祥', '2014210045', '男', '01041402', '0104', '信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('279', '侯宗壮', '2014210046', '男', '01041401', '0104', '信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('280', '苏炳瑄', '2014210047', '男', '01041401', '0104', '信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('281', '韦昌权', '2014210048', '男', '01021401', '0102', '电子信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('282', '宋振远', '2014210049', '男', '01011401', '0101', '通信工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('283', '胡凌', '2014210050', '男', '01041401', '0104', '信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('284', '王江维', '2014210051', '男', '0191403', '0191', '通信学院IT精英班', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('285', '陈瑞', '2014210052', '男', '01011401', '0101', '通信工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('286', '刘鑫', '2014210053', '男', '01021401', '0102', '电子信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('287', '李文龙', '2014210054', '男', '01021401', '0102', '电子信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('288', '吴坤', '2014210055', '男', '0191403', '0191', '通信学院IT精英班', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('289', '李思贤', '2014210056', '男', '01011401', '0101', '通信工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('290', '李筑聪', '2014210057', '男', '01041401', '0104', '信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('291', '刘颖杰', '2014210058', '男', '01021501', '0102', '电子信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('292', '李劲宇', '2014210059', '男', '01011401', '0101', '通信工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('293', '王磊', '2014210060', '男', '01011401', '0101', '通信工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('294', '刘迅', '2014210061', '男', '01011401', '0101', '通信工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('295', '江川', '2014210062', '男', '01011401', '0101', '通信工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('296', '周武林', '2014210063', '男', '01051401', '0105', '广播电视工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('297', '刘圣平', '2014210064', '男', '01021401', '0102', '电子信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('298', '刘松林', '2014210065', '男', '01051401', '0105', '广播电视工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('299', '刘磊', '2014210066', '男', '01021401', '0102', '电子信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('300', '胡迎春', '2014210067', '女', '01021401', '0102', '电子信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('301', '龙欣', '2014210068', '女', '01011401', '0101', '通信工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('302', '曹玲', '2014210069', '女', '01021401', '0102', '电子信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('303', '刘燕清', '2014210070', '女', '01021401', '0102', '电子信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('304', '毛骄', '2014210071', '女', '01011401', '0101', '通信工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('305', '卓玛', '2014210072', '女', '01021401', '0102', '电子信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('306', '张若羽', '2014210073', '女', '0191401', '0190', '通信工程专业卓越工程师班', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('307', '李露露', '2014210074', '女', '01011402', '0101', '通信工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('308', '李小可', '2014210075', '女', '01011402', '0101', '通信工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('309', '杜春玲', '2014210076', '女', '01021401', '0102', '电子信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('310', '陈欢', '2014210077', '女', '01021401', '0102', '电子信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('311', '张斌', '2014210078', '男', '01041401', '0104', '信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('312', '何瑞', '2014210079', '男', '01021401', '0102', '电子信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('313', '彭绍志', '2014210080', '男', '01051401', '0105', '广播电视工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('314', '吴育辉', '2014210081', '男', '01041401', '0104', '信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('315', '史雪飞', '2014210082', '男', '01011402', '0101', '通信工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('316', '魏晨', '2014210083', '男', '01021501', '0102', '电子信息工程', '2015', null, null, null, '1');
INSERT INTO `students` VALUES ('317', '陈亚彪', '2014210084', '男', '0191403', '0191', '通信学院IT精英班', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('318', '王星宇', '2014210085', '男', 'GJ011401', '0192', '通信工程国际实验班', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('319', '吕仲韬', '2014210086', '男', '01021402', '0102', '电子信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('320', '石明坤', '2014210087', '男', '01051401', '0105', '广播电视工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('321', '王鲲鹏', '2014210089', '男', '01011402', '0101', '通信工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('322', '曾阳', '2014210090', '男', '01011402', '0101', '通信工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('323', '杨恒', '2014210091', '男', '0191403', '0191', '通信学院IT精英班', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('324', '寿炳', '2014210092', '男', '01011402', '0101', '通信工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('325', '周林川', '2014210093', '男', '01041401', '0104', '信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('326', '夏黄卫', '2014210094', '男', '01041401', '0104', '信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('327', '刘洋', '2014210095', '男', '01021402', '0102', '电子信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('328', '邹文杰', '2014210096', '男', '01011402', '0101', '通信工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('329', '冉迎希', '2014210097', '男', '01021402', '0102', '电子信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('330', '唐德智', '2014210098', '男', '01021402', '0102', '电子信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('331', '方强', '2014210099', '男', '01021402', '0102', '电子信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('332', '简晓雯', '2014210100', '女', '01011402', '0101', '通信工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('333', '邓夏茹', '2014210101', '女', '0191402', '0190', '通信工程专业卓越工程师班', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('334', '陈金玉', '2014210102', '女', '01011402', '0101', '通信工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('335', '张楠楠', '2014210103', '女', '01051401', '0105', '广播电视工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('336', '曾玉', '2014210104', '女', '0191401', '0190', '通信工程专业卓越工程师班', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('337', '央吉', '2014210105', '女', '01021402', '0102', '电子信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('338', '陈容', '2014210106', '女', '01041402', '0104', '信息工程', '2014', null, null, null, '1');
INSERT INTO `students` VALUES ('339', '唐万梅', '2014210107', '女', '01021402', '0102', '电子信息工程', '2014', null, null, null, '1');

-- ----------------------------
-- Table structure for teachers
-- ----------------------------
DROP TABLE IF EXISTS `teachers`;
CREATE TABLE `teachers` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL,
  `gender` varchar(3) DEFAULT NULL,
  `teacher_num` varchar(11) NOT NULL,
  `class_num` varchar(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=3 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of teachers
-- ----------------------------
INSERT INTO `teachers` VALUES ('1', 'yunhan', '男', '123123', '13061501');
INSERT INTO `teachers` VALUES ('2', '老师', '男', '0000000000', '01021501');

-- ----------------------------
-- Table structure for users
-- ----------------------------
DROP TABLE IF EXISTS `users`;
CREATE TABLE `users` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(30) NOT NULL,
  `password` varchar(30) NOT NULL,
  `auth` int(1) NOT NULL,
  PRIMARY KEY (`id`),
  KEY `name` (`name`)
) ENGINE=MyISAM AUTO_INCREMENT=342 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of users
-- ----------------------------
INSERT INTO `users` VALUES ('1', '朱鸿翔', '2015210001', '1');
INSERT INTO `users` VALUES ('2', '刘奇', '2015210002', '1');
INSERT INTO `users` VALUES ('3', '黄思翔', '2015210004', '1');
INSERT INTO `users` VALUES ('4', '韩赵亮', '2015210005', '1');
INSERT INTO `users` VALUES ('5', '胡定昊', '2015210006', '1');
INSERT INTO `users` VALUES ('6', '李纯', '2015210007', '1');
INSERT INTO `users` VALUES ('7', '杜剑峰', '2015210008', '1');
INSERT INTO `users` VALUES ('8', '李潇', '2015210009', '1');
INSERT INTO `users` VALUES ('9', '刘宇超', '2015210010', '1');
INSERT INTO `users` VALUES ('10', '王志鹏', '2015210011', '1');
INSERT INTO `users` VALUES ('11', '熊一谦', '2015210012', '1');
INSERT INTO `users` VALUES ('12', '彭宇', '2015210013', '1');
INSERT INTO `users` VALUES ('13', '周楚航', '2015210014', '1');
INSERT INTO `users` VALUES ('14', '刘清宇', '2015210015', '1');
INSERT INTO `users` VALUES ('15', '曹汉', '2015210016', '1');
INSERT INTO `users` VALUES ('16', '吉星熹', '2015210017', '1');
INSERT INTO `users` VALUES ('17', '程曦', '2015210018', '1');
INSERT INTO `users` VALUES ('18', '吴文陶', '2015210019', '1');
INSERT INTO `users` VALUES ('19', '胡强', '2015210020', '1');
INSERT INTO `users` VALUES ('20', '吴天伟', '2015210021', '1');
INSERT INTO `users` VALUES ('21', '高亮', '2015210022', '1');
INSERT INTO `users` VALUES ('22', '程锡培', '2015210023', '1');
INSERT INTO `users` VALUES ('23', '杨鹏', '2015210024', '1');
INSERT INTO `users` VALUES ('24', '犹鑫', '2015210025', '1');
INSERT INTO `users` VALUES ('25', '范嘉辉', '2015210026', '1');
INSERT INTO `users` VALUES ('26', '张哲嘉', '2015210027', '1');
INSERT INTO `users` VALUES ('27', '王铮', '2015210028', '1');
INSERT INTO `users` VALUES ('28', '程禄丰', '2015210029', '1');
INSERT INTO `users` VALUES ('29', '杨航', '2015210030', '1');
INSERT INTO `users` VALUES ('30', '吴欣欣', '2015210031', '1');
INSERT INTO `users` VALUES ('31', '陈彦如', '2015210032', '1');
INSERT INTO `users` VALUES ('32', '马玉丹', '2015210033', '1');
INSERT INTO `users` VALUES ('33', '蒋尧莉', '2015210034', '1');
INSERT INTO `users` VALUES ('34', '任可心', '2015210035', '1');
INSERT INTO `users` VALUES ('35', '陈夏霖', '2015210036', '1');
INSERT INTO `users` VALUES ('36', '刘昕玥', '2015210037', '1');
INSERT INTO `users` VALUES ('37', '钟雨君', '2015210038', '1');
INSERT INTO `users` VALUES ('38', '李丽', '2015210039', '1');
INSERT INTO `users` VALUES ('39', '彭灿', '2015210040', '1');
INSERT INTO `users` VALUES ('40', '范中源', '2015210041', '1');
INSERT INTO `users` VALUES ('41', '吴思莹', '2015210042', '1');
INSERT INTO `users` VALUES ('42', '郑修文', '2015210043', '1');
INSERT INTO `users` VALUES ('43', '肖泽平', '2015210044', '1');
INSERT INTO `users` VALUES ('44', '刘浩杰', '2015210045', '1');
INSERT INTO `users` VALUES ('45', '袁新儒', '2015210046', '1');
INSERT INTO `users` VALUES ('46', '李瑞', '2015210047', '1');
INSERT INTO `users` VALUES ('47', '刘成鑫', '2015210048', '1');
INSERT INTO `users` VALUES ('48', '吴越', '2015210049', '1');
INSERT INTO `users` VALUES ('49', '陈明', '2015210050', '1');
INSERT INTO `users` VALUES ('50', '柯昌浩', '2015210051', '1');
INSERT INTO `users` VALUES ('51', '尚浩然', '2015210052', '1');
INSERT INTO `users` VALUES ('52', '李云杰', '2015210053', '1');
INSERT INTO `users` VALUES ('53', '袁瑞', '2015210054', '1');
INSERT INTO `users` VALUES ('54', '刘言', '2015210055', '1');
INSERT INTO `users` VALUES ('55', '单飞宇', '2015210056', '1');
INSERT INTO `users` VALUES ('56', '何缘', '2015210057', '1');
INSERT INTO `users` VALUES ('57', '杨润明', '2015210058', '1');
INSERT INTO `users` VALUES ('58', '卢思宏', '2015210059', '1');
INSERT INTO `users` VALUES ('59', '贺杨洪', '2015210061', '1');
INSERT INTO `users` VALUES ('60', '傅安民', '2015210062', '1');
INSERT INTO `users` VALUES ('61', '李松', '2015210064', '1');
INSERT INTO `users` VALUES ('62', '尚炳呈', '2015210065', '1');
INSERT INTO `users` VALUES ('63', '王志', '2015210066', '1');
INSERT INTO `users` VALUES ('64', '宋浩南', '2015210067', '1');
INSERT INTO `users` VALUES ('65', '向晋钱', '2015210068', '1');
INSERT INTO `users` VALUES ('66', '刘东坡', '2015210069', '1');
INSERT INTO `users` VALUES ('67', '刘广敏', '2015210070', '1');
INSERT INTO `users` VALUES ('68', '邓乂铭', '2015210071', '1');
INSERT INTO `users` VALUES ('69', '邹政', '2015210072', '1');
INSERT INTO `users` VALUES ('70', '张雨萱', '2015210073', '1');
INSERT INTO `users` VALUES ('71', '崔文娟', '2015210074', '1');
INSERT INTO `users` VALUES ('72', '刘璇', '2015210075', '1');
INSERT INTO `users` VALUES ('73', '任媛', '2015210076', '1');
INSERT INTO `users` VALUES ('74', '李羿莹', '2015210077', '1');
INSERT INTO `users` VALUES ('75', '潘多', '2015210078', '1');
INSERT INTO `users` VALUES ('76', '何梅', '2015210079', '1');
INSERT INTO `users` VALUES ('77', '刘露花', '2015210080', '1');
INSERT INTO `users` VALUES ('78', '解诗娟', '2015210081', '1');
INSERT INTO `users` VALUES ('79', '舒凡一', '2015210082', '1');
INSERT INTO `users` VALUES ('80', '谭阳', '2015210083', '1');
INSERT INTO `users` VALUES ('81', '严沁春', '2015210084', '1');
INSERT INTO `users` VALUES ('82', '汪智平', '2015210085', '1');
INSERT INTO `users` VALUES ('83', '陈东航', '2015210086', '1');
INSERT INTO `users` VALUES ('84', '张威', '2015210087', '1');
INSERT INTO `users` VALUES ('85', '易剑锋', '2015210088', '1');
INSERT INTO `users` VALUES ('86', '张天皓', '2015210089', '1');
INSERT INTO `users` VALUES ('87', '刘湃', '2015210090', '1');
INSERT INTO `users` VALUES ('88', '苏海超', '2015210091', '1');
INSERT INTO `users` VALUES ('89', '万志远', '2015210092', '1');
INSERT INTO `users` VALUES ('90', '张家伟', '2015210093', '1');
INSERT INTO `users` VALUES ('91', '任帆', '2015210094', '1');
INSERT INTO `users` VALUES ('92', '彭俊', '2015210095', '1');
INSERT INTO `users` VALUES ('93', '周极', '2015210096', '1');
INSERT INTO `users` VALUES ('94', '杨杰', '2015210097', '1');
INSERT INTO `users` VALUES ('95', '朱良伟', '2015210098', '1');
INSERT INTO `users` VALUES ('96', '易祖政', '2015210099', '1');
INSERT INTO `users` VALUES ('97', '刘金鑫', '2015210100', '1');
INSERT INTO `users` VALUES ('98', '杨贵钦', '2015210101', '1');
INSERT INTO `users` VALUES ('99', '余扬', '2015210102', '1');
INSERT INTO `users` VALUES ('100', '刘颖', '2015210103', '1');
INSERT INTO `users` VALUES ('101', '安鑫', '2015210104', '1');
INSERT INTO `users` VALUES ('102', '周渝阳', '2015210105', '1');
INSERT INTO `users` VALUES ('103', '何理', '2015210106', '1');
INSERT INTO `users` VALUES ('104', '袁圣东', '2015210107', '1');
INSERT INTO `users` VALUES ('105', '张松', '2015210108', '1');
INSERT INTO `users` VALUES ('106', '吴航', '2015210109', '1');
INSERT INTO `users` VALUES ('107', '荣安珉', '2015210110', '1');
INSERT INTO `users` VALUES ('108', '付思成', '2015210112', '1');
INSERT INTO `users` VALUES ('109', '何植', '2015210113', '1');
INSERT INTO `users` VALUES ('110', '谭望', '2015210114', '1');
INSERT INTO `users` VALUES ('111', '赵泽桐', '2015210115', '1');
INSERT INTO `users` VALUES ('112', '王小妮', '2016210001', '1');
INSERT INTO `users` VALUES ('113', '何江月', '2016210002', '1');
INSERT INTO `users` VALUES ('114', '王小妮', '2016210001', '1');
INSERT INTO `users` VALUES ('115', '杜扬', '2016210003', '1');
INSERT INTO `users` VALUES ('116', '何江月', '2016210002', '1');
INSERT INTO `users` VALUES ('117', '李雨', '2016210004', '1');
INSERT INTO `users` VALUES ('118', '杜扬', '2016210003', '1');
INSERT INTO `users` VALUES ('119', '汤光玲', '2016210005', '1');
INSERT INTO `users` VALUES ('120', '李雨', '2016210004', '1');
INSERT INTO `users` VALUES ('121', '谭应鑫', '2016210006', '1');
INSERT INTO `users` VALUES ('122', '汤光玲', '2016210005', '1');
INSERT INTO `users` VALUES ('123', '李婷', '2016210007', '1');
INSERT INTO `users` VALUES ('124', '谭应鑫', '2016210006', '1');
INSERT INTO `users` VALUES ('125', '李婷', '2016210007', '1');
INSERT INTO `users` VALUES ('126', '曹希孟', '2016210008', '1');
INSERT INTO `users` VALUES ('127', '谭雨薇', '2016210009', '1');
INSERT INTO `users` VALUES ('128', '吴啸凡', '2016210012', '1');
INSERT INTO `users` VALUES ('129', '陈俊帆', '2016210013', '1');
INSERT INTO `users` VALUES ('130', '贺易', '2016210014', '1');
INSERT INTO `users` VALUES ('131', '肖涛', '2016210016', '1');
INSERT INTO `users` VALUES ('132', '潘玮峰', '2016210017', '1');
INSERT INTO `users` VALUES ('133', '李学定', '2016210018', '1');
INSERT INTO `users` VALUES ('134', '陈伟龙', '2016210019', '1');
INSERT INTO `users` VALUES ('135', '朱思韬', '2016210020', '1');
INSERT INTO `users` VALUES ('136', '梁建明', '2016210021', '1');
INSERT INTO `users` VALUES ('137', '周雅风', '2016210022', '1');
INSERT INTO `users` VALUES ('138', '龚渝恒', '2016210023', '1');
INSERT INTO `users` VALUES ('139', '张越', '2016210024', '1');
INSERT INTO `users` VALUES ('140', '黄成林', '2016210025', '1');
INSERT INTO `users` VALUES ('141', '黄俊涛', '2016210026', '1');
INSERT INTO `users` VALUES ('142', '费阳', '2016210027', '1');
INSERT INTO `users` VALUES ('143', '邵俊鑫', '2016210028', '1');
INSERT INTO `users` VALUES ('144', '胡元洋', '2016210029', '1');
INSERT INTO `users` VALUES ('145', '郎凤林', '2016210030', '1');
INSERT INTO `users` VALUES ('146', '王鹏', '2016210031', '1');
INSERT INTO `users` VALUES ('147', '杨天铭', '2016210032', '1');
INSERT INTO `users` VALUES ('148', '李德鑫', '2016210033', '1');
INSERT INTO `users` VALUES ('149', '姚原', '2016210034', '1');
INSERT INTO `users` VALUES ('150', '王云涛', '2016210035', '1');
INSERT INTO `users` VALUES ('151', '季东生', '2016210036', '1');
INSERT INTO `users` VALUES ('152', '韩铭', '2016210037', '1');
INSERT INTO `users` VALUES ('153', '徐闯', '2016210038', '1');
INSERT INTO `users` VALUES ('154', '刘佳', '2016210039', '1');
INSERT INTO `users` VALUES ('155', '刘玲玲', '2016210040', '1');
INSERT INTO `users` VALUES ('156', '贺春瑛', '2016210042', '1');
INSERT INTO `users` VALUES ('157', '毕萍', '2016210043', '1');
INSERT INTO `users` VALUES ('158', '李霜', '2016210044', '1');
INSERT INTO `users` VALUES ('159', '严以宁', '2016210045', '1');
INSERT INTO `users` VALUES ('160', '梁盛源', '2016210046', '1');
INSERT INTO `users` VALUES ('161', '穆城', '2016210047', '1');
INSERT INTO `users` VALUES ('162', '刘梦君', '2016210048', '1');
INSERT INTO `users` VALUES ('163', '杨瑞鑫', '2016210049', '1');
INSERT INTO `users` VALUES ('164', '薛东林', '2016210050', '1');
INSERT INTO `users` VALUES ('165', '兰铭成', '2016210051', '1');
INSERT INTO `users` VALUES ('166', '梅子剑', '2016210052', '1');
INSERT INTO `users` VALUES ('167', '江昊东', '2016210053', '1');
INSERT INTO `users` VALUES ('168', '梁蒸胤', '2016210054', '1');
INSERT INTO `users` VALUES ('169', '吴松泽', '2016210055', '1');
INSERT INTO `users` VALUES ('170', '江松芸', '2016210056', '1');
INSERT INTO `users` VALUES ('171', '王家军', '2016210057', '1');
INSERT INTO `users` VALUES ('172', '袁瑞', '2016210058', '1');
INSERT INTO `users` VALUES ('173', '彭子豪', '2016210059', '1');
INSERT INTO `users` VALUES ('174', '蒋汶航', '2016210060', '1');
INSERT INTO `users` VALUES ('175', '石浩宇', '2016210061', '1');
INSERT INTO `users` VALUES ('176', '龙渝', '2016210062', '1');
INSERT INTO `users` VALUES ('177', '胡志强', '2016210063', '1');
INSERT INTO `users` VALUES ('178', '田松江', '2016210064', '1');
INSERT INTO `users` VALUES ('179', '张鑫', '2016210065', '1');
INSERT INTO `users` VALUES ('180', '阳皓晴', '2016210066', '1');
INSERT INTO `users` VALUES ('181', '郑雄峰', '2016210067', '1');
INSERT INTO `users` VALUES ('182', '李明佳', '2016210068', '1');
INSERT INTO `users` VALUES ('183', '孟玉林', '2016210069', '1');
INSERT INTO `users` VALUES ('184', '冯星星', '2016210070', '1');
INSERT INTO `users` VALUES ('185', '张敏', '2016210071', '1');
INSERT INTO `users` VALUES ('186', '朱若楠', '2016210072', '1');
INSERT INTO `users` VALUES ('187', '李悦', '2016210073', '1');
INSERT INTO `users` VALUES ('188', '章淑惠', '2016210074', '1');
INSERT INTO `users` VALUES ('189', '邓蓉', '2016210075', '1');
INSERT INTO `users` VALUES ('190', '朱锦文', '2016210076', '1');
INSERT INTO `users` VALUES ('191', '黎园园', '2016210077', '1');
INSERT INTO `users` VALUES ('192', '夏慧诗', '2016210078', '1');
INSERT INTO `users` VALUES ('193', '叶香麟', '2016210079', '1');
INSERT INTO `users` VALUES ('194', '刘亚辉', '2016210080', '1');
INSERT INTO `users` VALUES ('195', '甘胜海', '2016210081', '1');
INSERT INTO `users` VALUES ('196', '孙合序', '2016210082', '1');
INSERT INTO `users` VALUES ('197', '岳勇良', '2016210083', '1');
INSERT INTO `users` VALUES ('198', '万梦军', '2016210084', '1');
INSERT INTO `users` VALUES ('199', '董西宇', '2016210085', '1');
INSERT INTO `users` VALUES ('200', '缪祥', '2016210086', '1');
INSERT INTO `users` VALUES ('201', '范大千', '2016210087', '1');
INSERT INTO `users` VALUES ('202', '周杰', '2016210088', '1');
INSERT INTO `users` VALUES ('203', '祝逸飞', '2016210089', '1');
INSERT INTO `users` VALUES ('204', '梁炬鸿', '2016210090', '1');
INSERT INTO `users` VALUES ('205', '李定举', '2016210091', '1');
INSERT INTO `users` VALUES ('206', '柯达', '2016210092', '1');
INSERT INTO `users` VALUES ('207', '徐茁', '2016210093', '1');
INSERT INTO `users` VALUES ('208', '游小彬', '2016210094', '1');
INSERT INTO `users` VALUES ('209', '何凡', '2016210095', '1');
INSERT INTO `users` VALUES ('210', '夏茂洲', '2016210096', '1');
INSERT INTO `users` VALUES ('211', '石李城', '2016210097', '1');
INSERT INTO `users` VALUES ('212', '罗浩文', '2016210098', '1');
INSERT INTO `users` VALUES ('213', '张鑫', '2016210099', '1');
INSERT INTO `users` VALUES ('214', '陈钦', '2016210100', '1');
INSERT INTO `users` VALUES ('215', '梁庆', '2016210101', '1');
INSERT INTO `users` VALUES ('216', '郭浩男', '2016210102', '1');
INSERT INTO `users` VALUES ('217', '谭林', '2016210103', '1');
INSERT INTO `users` VALUES ('218', '付勇奇', '2016210104', '1');
INSERT INTO `users` VALUES ('219', '刘洪权', '2016210105', '1');
INSERT INTO `users` VALUES ('220', '贯圆意', '2016210106', '1');
INSERT INTO `users` VALUES ('221', '闫孟哲', '2016210107', '1');
INSERT INTO `users` VALUES ('222', '王颢潼', '2016210108', '1');
INSERT INTO `users` VALUES ('223', '刘艺锦', '2016210109', '1');
INSERT INTO `users` VALUES ('224', '陶思琪', '2016210110', '1');
INSERT INTO `users` VALUES ('225', '龙思樵', '2016210111', '1');
INSERT INTO `users` VALUES ('226', '蒋明月', '2016210112', '1');
INSERT INTO `users` VALUES ('227', '王琳', '2016210113', '1');
INSERT INTO `users` VALUES ('228', '陈晨', '2016210114', '1');
INSERT INTO `users` VALUES ('229', '马盼元', '2016210115', '1');
INSERT INTO `users` VALUES ('230', '刘吉', '2016210116', '1');
INSERT INTO `users` VALUES ('231', '李尧', '2016210117', '1');
INSERT INTO `users` VALUES ('232', '李泽宇', '2016210118', '1');
INSERT INTO `users` VALUES ('233', '欧阳思铭', '2016210119', '1');
INSERT INTO `users` VALUES ('234', '李炅炜', '2016210120', '1');
INSERT INTO `users` VALUES ('235', '林志强', '2016210121', '1');
INSERT INTO `users` VALUES ('236', '宋林校', '2016210122', '1');
INSERT INTO `users` VALUES ('237', '郑韵雯', '2014210001', '1');
INSERT INTO `users` VALUES ('238', '佘佳玲', '2014210002', '1');
INSERT INTO `users` VALUES ('239', '尤洋洋', '2014210003', '1');
INSERT INTO `users` VALUES ('240', '孟倩英', '2014210004', '1');
INSERT INTO `users` VALUES ('241', '宋艾遥', '2014210005', '1');
INSERT INTO `users` VALUES ('242', '郭业蛟', '2014210006', '1');
INSERT INTO `users` VALUES ('243', '莫雪莎', '2014210007', '1');
INSERT INTO `users` VALUES ('244', '王婧', '2014210008', '1');
INSERT INTO `users` VALUES ('245', '李鑫', '2014210009', '1');
INSERT INTO `users` VALUES ('246', '冉俊玲', '2014210010', '1');
INSERT INTO `users` VALUES ('247', '钟艾玲', '2014210011', '1');
INSERT INTO `users` VALUES ('248', '徐浩', '2014210012', '1');
INSERT INTO `users` VALUES ('249', '沙桐', '2014210013', '1');
INSERT INTO `users` VALUES ('250', '冯秋明', '2014210014', '1');
INSERT INTO `users` VALUES ('251', '陶子鸣', '2014210015', '1');
INSERT INTO `users` VALUES ('252', '冯航涛', '2014210016', '1');
INSERT INTO `users` VALUES ('253', '夏小刚', '2014210017', '1');
INSERT INTO `users` VALUES ('254', '欧阳转', '2014210018', '1');
INSERT INTO `users` VALUES ('255', '宋子亮', '2014210019', '1');
INSERT INTO `users` VALUES ('256', '丁鸽', '2014210020', '1');
INSERT INTO `users` VALUES ('257', '王尚尚', '2014210021', '1');
INSERT INTO `users` VALUES ('258', '陈镤镭', '2014210022', '1');
INSERT INTO `users` VALUES ('259', '陈证元', '2014210024', '1');
INSERT INTO `users` VALUES ('260', '张浩', '2014210025', '1');
INSERT INTO `users` VALUES ('261', '贺燕华', '2014210026', '1');
INSERT INTO `users` VALUES ('262', '李鑫', '2014210028', '1');
INSERT INTO `users` VALUES ('263', '彭泓月', '2014210029', '1');
INSERT INTO `users` VALUES ('264', '景坤飞', '2014210030', '1');
INSERT INTO `users` VALUES ('265', '张何堰', '2014210031', '1');
INSERT INTO `users` VALUES ('266', '段书桥', '2014210033', '1');
INSERT INTO `users` VALUES ('267', '刘慧', '2014210034', '1');
INSERT INTO `users` VALUES ('268', '周玉佳', '2014210035', '1');
INSERT INTO `users` VALUES ('269', '成书杉', '2014210036', '1');
INSERT INTO `users` VALUES ('270', '杨梦梅', '2014210037', '1');
INSERT INTO `users` VALUES ('271', '陈露', '2014210038', '1');
INSERT INTO `users` VALUES ('272', '李蔚星', '2014210039', '1');
INSERT INTO `users` VALUES ('273', '杜静菲', '2014210040', '1');
INSERT INTO `users` VALUES ('274', '曾勤', '2014210041', '1');
INSERT INTO `users` VALUES ('275', '谢攀', '2014210042', '1');
INSERT INTO `users` VALUES ('276', '龙鑫', '2014210043', '1');
INSERT INTO `users` VALUES ('277', '夏吉玲', '2014210044', '1');
INSERT INTO `users` VALUES ('278', '赵祥祥', '2014210045', '1');
INSERT INTO `users` VALUES ('279', '侯宗壮', '2014210046', '1');
INSERT INTO `users` VALUES ('280', '苏炳瑄', '2014210047', '1');
INSERT INTO `users` VALUES ('281', '韦昌权', '2014210048', '1');
INSERT INTO `users` VALUES ('282', '宋振远', '2014210049', '1');
INSERT INTO `users` VALUES ('283', '胡凌', '2014210050', '1');
INSERT INTO `users` VALUES ('284', '王江维', '2014210051', '1');
INSERT INTO `users` VALUES ('285', '陈瑞', '2014210052', '1');
INSERT INTO `users` VALUES ('286', '刘鑫', '2014210053', '1');
INSERT INTO `users` VALUES ('287', '李文龙', '2014210054', '1');
INSERT INTO `users` VALUES ('288', '吴坤', '2014210055', '1');
INSERT INTO `users` VALUES ('289', '李思贤', '2014210056', '1');
INSERT INTO `users` VALUES ('290', '李筑聪', '2014210057', '1');
INSERT INTO `users` VALUES ('291', '刘颖杰', '2014210058', '1');
INSERT INTO `users` VALUES ('292', '李劲宇', '2014210059', '1');
INSERT INTO `users` VALUES ('293', '王磊', '2014210060', '1');
INSERT INTO `users` VALUES ('294', '刘迅', '2014210061', '1');
INSERT INTO `users` VALUES ('295', '江川', '2014210062', '1');
INSERT INTO `users` VALUES ('296', '周武林', '2014210063', '1');
INSERT INTO `users` VALUES ('297', '刘圣平', '2014210064', '1');
INSERT INTO `users` VALUES ('298', '刘松林', '2014210065', '1');
INSERT INTO `users` VALUES ('299', '刘磊', '2014210066', '1');
INSERT INTO `users` VALUES ('300', '胡迎春', '2014210067', '1');
INSERT INTO `users` VALUES ('301', '龙欣', '2014210068', '1');
INSERT INTO `users` VALUES ('302', '曹玲', '2014210069', '1');
INSERT INTO `users` VALUES ('303', '刘燕清', '2014210070', '1');
INSERT INTO `users` VALUES ('304', '毛骄', '2014210071', '1');
INSERT INTO `users` VALUES ('305', '卓玛', '2014210072', '1');
INSERT INTO `users` VALUES ('306', '张若羽', '2014210073', '1');
INSERT INTO `users` VALUES ('307', '李露露', '2014210074', '1');
INSERT INTO `users` VALUES ('308', '李小可', '2014210075', '1');
INSERT INTO `users` VALUES ('309', '杜春玲', '2014210076', '1');
INSERT INTO `users` VALUES ('310', '陈欢', '2014210077', '1');
INSERT INTO `users` VALUES ('311', '张斌', '2014210078', '1');
INSERT INTO `users` VALUES ('312', '何瑞', '2014210079', '1');
INSERT INTO `users` VALUES ('313', '彭绍志', '2014210080', '1');
INSERT INTO `users` VALUES ('314', '吴育辉', '2014210081', '1');
INSERT INTO `users` VALUES ('315', '史雪飞', '2014210082', '1');
INSERT INTO `users` VALUES ('316', '魏晨', '2014210083', '1');
INSERT INTO `users` VALUES ('317', '陈亚彪', '2014210084', '1');
INSERT INTO `users` VALUES ('318', '王星宇', '2014210085', '1');
INSERT INTO `users` VALUES ('319', '吕仲韬', '2014210086', '1');
INSERT INTO `users` VALUES ('320', '石明坤', '2014210087', '1');
INSERT INTO `users` VALUES ('321', '王鲲鹏', '2014210089', '1');
INSERT INTO `users` VALUES ('322', '曾阳', '2014210090', '1');
INSERT INTO `users` VALUES ('323', '杨恒', '2014210091', '1');
INSERT INTO `users` VALUES ('324', '寿炳', '2014210092', '1');
INSERT INTO `users` VALUES ('325', '周林川', '2014210093', '1');
INSERT INTO `users` VALUES ('326', '夏黄卫', '2014210094', '1');
INSERT INTO `users` VALUES ('327', '刘洋', '2014210095', '1');
INSERT INTO `users` VALUES ('328', '邹文杰', '2014210096', '1');
INSERT INTO `users` VALUES ('329', '冉迎希', '2014210097', '1');
INSERT INTO `users` VALUES ('330', '唐德智', '2014210098', '1');
INSERT INTO `users` VALUES ('331', '方强', '2014210099', '1');
INSERT INTO `users` VALUES ('332', '简晓雯', '2014210100', '1');
INSERT INTO `users` VALUES ('333', '邓夏茹', '2014210101', '1');
INSERT INTO `users` VALUES ('334', '陈金玉', '2014210102', '1');
INSERT INTO `users` VALUES ('335', '张楠楠', '2014210103', '1');
INSERT INTO `users` VALUES ('336', '曾玉', '2014210104', '1');
INSERT INTO `users` VALUES ('337', '央吉', '2014210105', '1');
INSERT INTO `users` VALUES ('338', '陈容', '2014210106', '1');
INSERT INTO `users` VALUES ('339', '唐万梅', '2014210107', '1');
INSERT INTO `users` VALUES ('340', '老师', '0000000000', '2');
INSERT INTO `users` VALUES ('341', '管理员', '000', '3');
DROP TRIGGER IF EXISTS `add_name`;
DELIMITER ;;
CREATE TRIGGER `add_name` AFTER INSERT ON `students` FOR EACH ROW insert into users (name,password,auth) values(new.name,new.password,'1')
;;
DELIMITER ;
DROP TRIGGER IF EXISTS `change_name`;
DELIMITER ;;
CREATE TRIGGER `change_name` AFTER UPDATE ON `students` FOR EACH ROW update users set name=new.name where id = old.id
;;
DELIMITER ;
SET FOREIGN_KEY_CHECKS=1;
